<?php
/**
 * Created by PhpStorm.
 * User: gagau
 * Date: 15.02.2019
 * Time: 15:26
 */
//2. Сделать несколько файлов, в которых будет по несколько массивов, с переменным количеством елментов в них(во всех по разному), а затем выводить их на экран при помощи цикла for
  //  пример: $arr = [1,2,32,321,3,12,3];
    //for(что-то ; что-то ;что-то)

$a = ['Maxim','Carp','Odessa','Facebook','Rolex','PHP','SteelSeries'];
for ($i = 0; $i<=count($a); $i++)
{
    echo $a[$i].'<br>';
}


$b = [1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20];
for ($i = 0; $i<=count($b);$i++)
{
    echo $b[$i].'<br>';
}

$max =['fasdf', 'sadfas','asdfasdf', 1321321,123321,5655,49879,887897,87987,465,489,4465,48,49,4,89,456,489,4,5,489,4,654,89,489,4,8,4984,98,498,498,4,894,98,498,498,4,894,8,49,84,98,89,'<br>'];

for ($i = 0; $i <=count($max); $i++)
{
    echo $max[$i].'<br>';
}

