<?php
/**
 * Created by PhpStorm.
 * User: gagau
 * Date: 22.01.2019
 * Time: 9:26
 */
//Написать несколько if-конструкций, как пример для входа на сайта(проверка логина и пароля) во всех вариациях что ты придумаешь.
// (Отрицание, операторы AND / OR и так далее, всё что придумаешь)


$login = 'ruiner';
$password = 123;


if ($login == 'ruiner' and $password == 123)
{
    echo 'Привет '. $login . '<br>';
}else
    {
        echo ' Логин или пароль неверный <br>';
    }

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
$login = 'rak';
$password = 228;

if ( $login == 'rak' or $password ==228)
{
    echo 'добро пожаловать на сайт, ' . $login . '<br>';
}else
    {
        echo 'проваливай, рачила <br>';
    }

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

if ($login != 'ruiner' or ($login != 'rak' and $password != 228 and $password == 229  ))
{
    echo 'Привет ' . $login . ' результат третьего примера<br>';
} else
    {
        echo 'Пока, долбоклюй <br>';
    }

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
$login = 'chemodan';
$password = 332;

if ($login !== 'shemodan' and $password <= 336)
{
    echo 'Привет ' . $login . '<br>';

}else
    {
        echo ' Логин или пароль неверный <br>';
    }
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

if ($login <> 'chemodans' )
{
    echo 'Привет ' . $login . '<br>';
}
if ($password >= 332)
{
 echo ' Пароль неверный <br>';
}
    

