<?php 

$joska = 'æåñòêî';
$name = 'Ìàêñèì';
$age = '26';
$dota = 'äîòó';
$up = 'ðàñòè';
$skill = 'ñêèëóõó';
echo 'Ìåíÿ çîâóò ' . $name . ' ,  ìíå '.  $age . ' ëåò. ß äîâîëüíî äàâíî èãðàþ â ' . $dota . '. Èãðàþ ' . $joska . ' , êàðàþ è åáîøó òàê æå '. $joska .  '. À òàê æå ÿ ëþáëþ '.  $up .  ' è óìíîæàòü ñâîþ ' . $skill . '.';
 
$karp = 'Êàðï';
$maxim = 'Ìàêñèì';
$name3 = 'Ìèõàéëîâè÷';
$birth = '166*12';
$old = '13+13';
$tolstoi = '101-50';
$rumyan = '12/2';
$tolstoi2 = 'Òîëñòîãî';
$rumyan2 = 'Ðóìÿíöåâà';
$rojden = 'ðîæäåíèÿ';
echo 'Ìåíÿ çîâóò'. $karp . $maxim . $name3 . 166*12  ;



 /*
 Ìåíÿ çîâóò `Ìàêñèì`, ìíå `26` ëåò. ß äîâîëüíî äàâíî èãðàþ â `äîòó`. Èãðàþ `æåñòêî`, êàðàþ è åáîøó òàê æå `æåñòêî`. À òàê æå ÿ ëþáëþ `ðàñòè` è óìíîæàòü ñâîþ `ñêèëóõó`. 
*/

 /*
 Ìåíÿ çîâóò 'Êàðï'' `Ìàêñèì` 'Ìèõàéëîâè÷' '1992' ãîäà 'ðîæäåíèÿ', òî åñòü ìíå '26' ëåò. Æèâó ïî àäðåñó 'Òîëñòîãî', '51', âòîðîé àäðåñ 'Ðóìÿíöåâà', '6'.
*/

?>